Autodesk.Revit.DB.ServiceType
An enumerated type listing all of the built-in parameter groups supported by Autodesk
Revit.
Remarks: Parameter groups are used to sort parameters within the gbXML Setting item of the Project Information dialog.

Autodesk.Revit.DB.ServiceType.kSplitSystemsWithMechanicalVentilationWithCooling
Service Type is SplitSystemsWithMechanicalVentilationWithCooling.

Autodesk.Revit.DB.ServiceType.kSplitSystemsWithMechanicalVentilation
Service Type is SplitSystemsWithMechanicalVentilation.

Autodesk.Revit.DB.ServiceType.kSplitSystemsWithNaturalVentilation
Service Type is SplitSystemsWithNaturalVentilation.

Autodesk.Revit.DB.ServiceType.kVariableRefrigerantFlow
Service Type is VariableRefrigerantFlow.

Autodesk.Revit.DB.ServiceType.kWaterLoopHeatPump
Service Type is WaterLoopHeatPump.

Autodesk.Revit.DB.ServiceType.kActiveChilledBeams
Service Type is ActiveChilledBeams.

Autodesk.Revit.DB.ServiceType.kRadiantCooledCeilings
Service Type is RadiantCooledCeilings.

Autodesk.Revit.DB.ServiceType.kConstantVolumeDualDuct
Service Type is ConstantVolumeDualDuct.

Autodesk.Revit.DB.ServiceType.kMultizoneHotDeckColdDeck
Service Type is MultizoneHotDeckColdDeck.

Autodesk.Revit.DB.ServiceType.kConstantVolumeTerminalReheat
Service Type is ConstantVolumeTerminalReheat.

Autodesk.Revit.DB.ServiceType.kConstantVolumeVariableOA
Service Type is ConstantVolumeVariableOA.

Autodesk.Revit.DB.ServiceType.kConstantVolumeFixedOA
Service Type is ConstantVolumeFixedOA.

Autodesk.Revit.DB.ServiceType.kInductionSystem
Service Type is InductionSystem.

Autodesk.Revit.DB.ServiceType.kFanCoilSystem
Service Type is FanCoilSystem.

Autodesk.Revit.DB.ServiceType.kVAVTerminalReheat
Service Type is VAVTerminalReheat.

Autodesk.Revit.DB.ServiceType.kVAVIndoorPackagedCabinet
Service Type is VAVIndoorPackagedCabinet.

Autodesk.Revit.DB.ServiceType.kVAVDualDuct
Service Type is VAVDualDuct.

Autodesk.Revit.DB.ServiceType.kVAVSingleDuct
Service Type is VAVSingleDuct.

Autodesk.Revit.DB.ServiceType.kForcedConvectionHeaterNoFlue
Service Type is ForcedConvectionHeaterNoFlue.

Autodesk.Revit.DB.ServiceType.kForcedConvectionHeaterFlue
Service Type is ForcedConvectionHeaterFlue.

Autodesk.Revit.DB.ServiceType.kRadiantHeaterMultiburner
Service Type is RadiantHeaterMultiburner.

Autodesk.Revit.DB.ServiceType.kRadiantHeaterNoFlue
Service Type is RadiantHeaterNoFlue.

Autodesk.Revit.DB.ServiceType.kRadiantHeaterFlue
Service Type is RadiantHeaterFlue.

Autodesk.Revit.DB.ServiceType.kOtherRoomHeater
Service Type is OtherRoomHeater.

Autodesk.Revit.DB.ServiceType.kCentralHeatingHotAir
Service Type is CentralHeatingHotAir.

Autodesk.Revit.DB.ServiceType.kCentralHeatingRadiantFloor
Service Type is CentralHeatingRadiantFloor.

Autodesk.Revit.DB.ServiceType.kCentralHeatingConvectors
Service Type is CentralHeatingConvectors.

Autodesk.Revit.DB.ServiceType.kCentralHeatingRadiators
Service Type is CentralHeatingRadiators.

Autodesk.Revit.DB.ServiceType.kNoServiceType
Service Type is NoServiceType.